# info är själva skeletet av programmet som håller uppe  och bestämmer vad som kan/inte kan göras
master = True# master variabeln som bestämmer om spelet är på eller inte
# ned är ettlib som innehåller alla cotrol variabler
controls= {"controls":{"Forward":'w',"Backward":'s',"Left":'a',"Right":'d',"Pause":'esc', "Interact":'e',"Attack":'space'}}
menu_up=False# en variabel som bestämmer om menun är uppe eller inte
game= False# variabeln som bestämmer om man har startat spelet
loadroom = True# variabel som bestämmer om man ska ladda in ett nytt rum
H = 690#variabeln för spel yttans totala höjd
W = 900# totala spelytans bredd
difficulty = 0# svårighets graden
ratio = 20#ratio är alla rektanglars storlek
Wall = 2# vägg värde
Exit =0# den totala procent chansen för att vägen ut ska genereras
g_Hp=2# hp för spöket
p_Hp=4#hp för spelaren
spawn = False# variabel för om ett spöke har genererats 

ry = int(H/ratio)# totala antal runtor på y led
rx = int(W/ratio)# totala antal rutor på x led
Map = [[Wall for y in range(ry)]for x in range(rx)]# Map blir generarat som en list med alla totala rutor som får ursprungs värdet som vägg
# nedan är ett extremt långt lib som består av 16 bilder
#varje pic innehåler tre grejer
# en bild som min vän Dilovan har gjort
#ett delay värde
# och en string med filsökvägen till en mp3 fil
animation = {"pic1":["""
   ___                                _           ______             _    
  |_  |                              (_)          | ___ \           | |   
    | | _   _  ____  ____  ___   ___  _   ___     | |_/ /____  ____ | | __
    | || | | ||  __|/ _  |/ __| / __|| | / __|    |  __// _  ||  __|| |/ /
/\__/ /| |_| || |  | (_| |\__  \\\\_\| || (__     | |  | (_| || |   |   ( 
\____/  \____||_|   \____||___/ |___/|_| \___|    |_|   \____||_|   |_|\_\\""",3,"none"],"pic2":["""
                       ___________________
                      /                   \\                                                                  
     |_|_|_|_|       /   What a nice day   \\
    /         \\     /                       \\
   /   *   *   \\   / /\    I love digging    \\
  |      ^      | /  /  \                    /
   \   \___/   / \__/    \   for fossils    /
    \_________/           \________________/
        |
       /|\\    
      / | \\  /\\
     /  |  \\/
        |  /             ________
       / \\             /´       ´\\
     _/   \\_         /´           |    """,2,r'C:\Users\S8oliwit\Downloads\jurrasicsound\minecraft-villager-sound-effect.mp3'],"pic3":["""
                                                    _____            
                                                   |     |          ___________________
                                                   |     |         /                   \\         
   |_|_|_|_|                                      _|_____|_       /                     \\
  /         \\                                   /         \\    /     Doctor Grant?     \\
 /   *   *   \\                                 /   *   *   \\  /  /\                     \\
|      ^      |                                |      ^      | /  /  \                    /
 \   \___/   /                                  \   \___/   / \__/    \__________________/                 
  \_________/                                    \_________/           
       |                                             |
      /|\\                                           /|\\   __
     / | \\  /\\                                     / | \\ /  \\
    /  |  \\/                                      /  |  \\|
       |  /                                          |   |
      / \\                                           / \\  |
    _/   \\_                                       _/   \\_ """,2,r'C:\Users\S8oliwit\Downloads\jurrasicsound\minecraft-villager-sound-effect.mp3'],"pic4":["""
                                                    _____            
                                                   |     |          
                    _____________________          |     |                
   |_|_|_|_|       /                     \\       _|_____|_       
  /         \\     /        Yes?           \\    /         \\     
 /   *   *   \\   /  /\                     \\  /   *   *   \\  
|      ^      | /  /   \                   /   |      ^      | 
 \   \___/   / \__/     \_________________/     \   \___/   /                 
  \_________/                                    \_________/           
       |                                             |
      /|\\                                           /|\\   __
     / | \\  /\\                                     / | \\ /  \\
    /  |  \\/                                      /  |  \\|
       |  /                                          |   |
      / \\                                           / \\  |
    _/   \\_                                       _/   \\_ """,2,r'C:\Users\S8oliwit\Downloads\jurrasicsound\minecraft-villager-sound-effect.mp3'],"pic5":["""
                                                    _____            
                                                   |     |          ___________________
                                                   |     |         /                   \\         
   |_|_|_|_|                                      _|_____|_       /                     \\
  /         \\                                   /         \\     /  I need your help     \\
 /   *   *   \\                                 /   *   *   \\   /  /\                     \\
|      ^      |                                |      ^      | /  /  \     come with me   /
 \   \___/   /                                  \   \___/   / \__/    \__________________/                 
  \_________/                                    \_________/           
       |                                             |
      /|\\                                           /|\\   __
     / | \\  /\\                                     / | \\ /  \\
    /  |  \\/                                      /  |  \\|
       |  /                                          |   |
      / \\                                           / \\  |
    _/   \\_                                       _/   \\_ """,2,r'C:\Users\S8oliwit\Downloads\jurrasicsound\minecraft-villager-sound-effect.mp3'],"pic6":["""
                                                    _____            
                                                   |     |          
                    _____________________          |     |                
   |_|_|_|_|       /                     \\       _|_____|_       
  /         \\     /        Sure           \\    /         \\     
 /   *   *   \\   /  /\                     \\  /   *   *   \\  
|      ^      | /  /   \                   /   |      ^      | 
 \   \___/   / \__/     \_________________/     \   \___/   /                 
  \_________/                                    \_________/           
       |                                             |
      /|\\                                           /|\\   __
     / | \\  /\\                                     / | \\ /  \\
    /  |  \\/                                      /  |  \\|
       |  /                                          |   |
      / \\                                           / \\  |
    _/   \\_                                       _/   \\_ """,4,r'C:\Users\S8oliwit\Downloads\jurrasicsound\minecraft-villager-sound-effect.mp3'],"pic7":["""
  ___      ______                ___  ___                           _           _           _            
 / _ \     |  ___|               |  \/  |                          | |         | |         | |           
/ /_\ \    | |_ _____      __    | .  . | ___  _ __ ___   ___ _ __ | |_ ___    | |     __ _| |_ ___ _ __ 
|  _  |    |  _/ _ \ \ /\ / /    | |\/| |/ _ \| '_ ` _ \ / _ \ '_ \| __/ __|   | |    / _` | __/ _ \ '__|
| | | |    | ||  __/\ V  V /     | |  | | (_) | | | | | |  __/ | | | |_\__ \   | |___| (_| | ||  __/ |   
\_| |_/    \_| \___| \_/\_/      \_|  |_/\___/|_| |_| |_|\___|_| |_|\__|___/   \_____/\__,_|\__\___|_| """ ,2,r'C:\Users\S8oliwit\Downloads\jurrasicsound\A-FEW-MOMENTS-LATER-instrumentalfx.mp3'],"pic8":["""
                                        ___________________________    __________________________
                                        `--------------------------`()'--------------------------'
                                                                    ||
                                                                    ||                                        __
                                                              _....-||-----...._                             /  /
                                                          _,-=================`--.                       .'   /
                                                        ,' ) ,--. .-----.         `.___________________.'    /
                                                      .'  / /___| |_____|                                   /
                                                    /   / /____| |__|__|             ,---------------``\   \\
                                                   /================================/                   `.  \\
                                                  (    ----------------------------/                       `._\\
                                                    `-._\_____________________...--'
                                                        .____//______//___    
                                                        
                                                           ""","none",r'C:\Users\S8oliwit\Downloads\jurrasicsound\heli.mp3'],"pic9":["""
                            ___________________________    __________________________
                            `--------------------------`()'--------------------------'
                                                        ||
                                                        ||                                        __
                                                  _....-||-----...._                             /  /
                                              _,-=================`--.                       .'   /
                                            ,' ) ,--. .-----.         `.___________________.'    /
                                          .'  / /___| |_____|                                   /
                                        /   / /____| |__|__|             ,---------------``\   \\
                                       /================================/                   `.  \\
                                      (    ----------------------------/                       `._\\
                                        `-._\_____________________...--'
                                            .____//______//___   

                                            """ ,"none",r'C:\Users\S8oliwit\Downloads\jurrasicsound\heli.mp3'],"pic10":["""
                ___________________________    __________________________
                `--------------------------`()'--------------------------'
                                            ||
                                            ||                                        __
                                      _....-||-----...._                             /  /
                                  _,-=================`--.                       .'   /
                                ,' ) ,--. .-----.         `.___________________.'    /
                              .'  / /___| |_____|                                   /
                            /   / /____| |__|__|             ,---------------``\   \\
                           /================================/                   `.  \\
                          (    ----------------------------/                       `._\\
                            `-._\_____________________...--'
                                .____//______//___     

                              ""","none",r'C:\Users\S8oliwit\Downloads\jurrasicsound\heli.mp3'],"pic11":["""
                                                         ------------------------------
                                                                    ___/\___              _
                                                                  /|  ____   |___________//
                                                                (    |____|   ______-----/
                                                                 \___________/           
                                                                     _|___|_                             
                           ,--.\`-. __
                         _,.`. \:/,"  `-._
                     ,-*" _,.-;-*`-.+"*._ )
                    ( ,."* ,-" / `.  \.  `.
                   ,"   ,;"  ,"\../\  \:  \\
                  (   ,"/   / \.,' :   ))  /
                   \  |/   / \.,'  /  // ,' 
                    \_)\ ,' \.,'  (  / )/
                        `  \._,'   `"
                           \../
                           \../
                           \../           
                           \../   
                   __...---\../-...__ 
              _--'         \../      `--.__ 
        __ ,/               `"             `--.__ 
    ,--'                                         `--.
   '------......______             ______......------`""",1,"none"],"pic12":["""                                                                                                                                
                                               ------------------------------      
                                                          ___/\___              _                  
                                                        /|  ____   |___________//                                          
                           ,--.\`-. __                (    |____|   ______-----/
                         _,.`. \:/,"  `-._             \___________/
                     ,-*" _,.-;-*`-.+"*._ )               _|___|_ 
                    ( ,."* ,-" / `.  \.  `.
                   ,"   ,;"  ,"\../\  \:  \\
                  (   ,"/   / \.,' :   ))  /
                   \  |/   / \.,'  /  // ,' 
                    \_)\ ,' \.,'  (  / )/
                        `  \._,'   `"
                           \../
                           \../
                           \../           
                           \../   
                   __...---\../-...__ 
              _--'         \../      `--.__ 
        __ ,/               `"             `--.__ 
    ,--'                                         `--.
   '------......______             ______......------`"""  ,1,"none"],"pic13":["""                                                                                                                                                                                                                          
                           ,--.\`-. __                
                         _,.`. \:/,"  `-._             
                     ,-*" _,.-;-*`-.+"*._ )   ------------------------------   
                    ( ,."* ,-" / `.  \.  `.             ___/\___              _
                   ,"   ,;"  ,"\../\  \:  \\          /|  ____   |___________// 
                  (   ,"/   / \.,' :   ))  /        (    |____|   ______-----/
                   \  |/   / \.,'  /  // ,'          \___________/
                    \_)\ ,' \.,'  (  / )/               _|___|_
                        `  \._,'   `"
                           \../
                           \../
                           \../           
                           \../   
                   __...---\../-...__ 
              _--'         \../      `--.__ 
        __ ,/               `"             `--.__ 
    ,--'                                         `--.
   '------......______             ______......------`""" ,1,"none"],"pic14":["""  
     _____
    |     |
    |     |         _____________________             
   _|_____|_       /                     \\       
  /         \\     /     Welcome to        \\     
 /   *   *   \\   /  /\                     \\    
|      ^      | /  /   \   Jurassic park   /   
 \   \___/   / \__/     \_________________/                    
  \_________/                                               
       |                                             
      /|\\    __                                       
     / | \\  /  \\                                    
    /  |  \\|                                     
       |   |                                        
      / \\  |                                     
    _/   \\_         """,1,r'C:\Users\S8oliwit\Downloads\jurrasicsound\minecraft-villager-sound-effect.mp3'],"pic15":[""" 
  ____________
  \           \\
   \   RAWR!    \     .-----.
    \___________ \  .'  O   \\
                \_\(_____,   \\
                    `----.    \\
                          \    \\
                           \    \\
                            \     `.             _ _
                             \       ~- _ _ - ~       ~ - .
                              \                              ~-.
                               \                                `. 
                                \    /               /       \    \\
                                  `.|          }    |         }     \\
                                    |        /      |        /        \\
                                    |       /       |       /           \\
                                    |      /`- _ _ _|      /.- ~ ^-.      \\
                                    |     /         |     /          `.     \\
                                    |     |         |     |             -.   ` . _ _ _ _ _ _
                                    |_____|         |_____|                ~ . _ _ _ _ _ _ _ >""","none",r'C:\Users\S8oliwit\Downloads\jurrasicsound\Jurassic Park-[AudioTrimmer.com].mp3'],"pic16":["THANKS FOR PLAYING\nDeveloped by  Oliver Witzel\n Credit animations by Dilovan Yolbas",2,r'C:\Users\S8oliwit\Downloads\jurrasicsound\applause10.mp3']}